InformationRegisters/EUF_ПроводникСостояниеОбъектовОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>EUF_ПроводникСостояниеОбъектовОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.QIWI_АдаптерОбъектыОбмена</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.EUF_ПроводникВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнтеграционныйПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EUF_ПроводникИнтеграционныеПроцессы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/EUF_ПроводникСостояниеОбъектовОбмена/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция УстановитьСостояниеОбъектаОбмена(СтруктураЗаписи) Экспорт

	Результат = "";
	
	ПроверяемыеРеквизиты = Новый Массив;
	ПроверяемыеРеквизиты.Добавить("Объект");
	ПроверяемыеРеквизиты.Добавить("ВнешняяСистема");
	
	Для Каждого ПроверяемыйРеквизит Из ПроверяемыеРеквизиты Цикл
		Если СтруктураЗаписи.Свойство(ПроверяемыйРеквизит)
			И Не ЗначениеЗаполнено(СтруктураЗаписи[ПроверяемыйРеквизит]) Тогда
			
			ОписаниеСобытия = НСтр("ru = 'Добавление записи регистра сведений ""Состояние объектов обмена (QIWI адаптер)""'");
			Комментарий     = НСтр("ru = 'Не заполнен реквизит %1. Создание записи регистра невозможно.'");
			Комментарий     = СтрШаблон(Комментарий, ПроверяемыйРеквизит);
			ЗаписьЖурналаРегистрации(ОписаниеСобытия, 
			                         УровеньЖурналаРегистрации.Ошибка,
			                         Метаданные.РегистрыСведений.EUF_ПроводникСостояниеОбъектовОбмена,
			                         ,
			                         Комментарий);
			
			Возврат Комментарий;
			
		КонецЕсли;
	КонецЦикла;	
	
	// Устанавливаем состояние	
	МенеджерЗаписи = РегистрыСведений.EUF_ПроводникСостояниеОбъектовОбмена.СоздатьМенеджерЗаписи(); 
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтруктураЗаписи);
	Если СтруктураЗаписи.Свойство("ДатаСостояния") Тогда
		МенеджерЗаписи.ДатаСостояния = СтруктураЗаписи.ДатаСостояния;
	Иначе
		МенеджерЗаписи.ДатаСостояния = ТекущаяДатаСеанса();
	КонецЕсли;	
	МенеджерЗаписи.Записать();
		
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
